{
  "users": [
    {
      "id": "219b",
      "firstName": "test",
      "lastName": "testtt",
      "email": "test@gmail.com",
      "password": "test123"
    }
  ],
  "favoritesOffers": [
    {
      "id": "ef05",
      "userId": "219b",
      "offerId": "20489138",
      "title": "Software Engineer I, Forwarding App",
      "company": "Flexport",
      "location": "Beijing, China",
      "jobObject": {
        "id": "20489138",
        "title": "Software Engineer I, Forwarding App",
        "company": "Flexport",
        "location": "Beijing, China",
        "date": "2026-01-30T18:32:01Z",
        "url": "https://www.themuse.com/jobs/flexport/software-engineer-i-forwarding-app-f45520",
        "description": "<div><h2><strong>About Flexport:&nbsp;</strong></h2>\n<p>At Flexport, we believe global trade can move the human race forward. That’s why it’s our mission to make global commerce so easy there will be more of it. We’re shaping the future of a $10T industry with solutions powered by innovative technology and exceptional people. Today, companies of all sizes—from emerging brands to Fortune 500s—use Flexport technology to move more than $19B of merchandise across 112 countries a year.&nbsp;</p>\n<p>The recent global supply chain crisis has put Flexport center stage as we continue to play a pivotal role in how goods move around the world. We are proud to have the support of the best investors in the game who believe in our mission, solutions and people. Ready to tackle global challenges that impact business, society, and the environment? Come join us.</p></div>\n\n<h2><strong>The opportunity:</strong></h2>\n\n<p>Flexport is a platform for global trade in an industry that comprises 12% of the global GDP.&nbsp; We are the first licensed freight forwarder and customs brokerage built around a modern tech stack.&nbsp; We help the world's fastest-growing brands manage their international supply chains, providing a fully-managed service for moving products between any two places on the planet.</p>\n\n<p>Exceptional software development is integral in allowing us to fulfill our mission of fixing the user experience in global trade. At Flexport you’ll develop products that are at the forefront of reshaping the entire logistics &amp; supply chain industries. You’ll work alongside self-starters interested in solving real-world problems and streamlining the inefficiencies in the complex global trade industry. You’ll have the opportunity to reshape an industry by creating the new operating system for global trade.</p>\n\n<p>Our engineers are top-notch software developers who love listening to the users, working as a team, and proactively taking the lead whenever necessary. The role involves learning the business of freight forwarding, modeling the work that people do to move freight, designing solutions to make it more efficient, and thinking innovatively to automate much of it. In this role, you will have an opportunity to develop key parts of our forwarding systems. You will have the opportunity of influencing subsystem design and help contribute to a team culture around practices that are critical to a quality product.&nbsp;</p>\n\n<h2><strong>About the team:</strong></h2>\n\n<p>We have multiple teams in Shanghai and Shenzhen working on a suite of core products and services that enable Flexport operation to scale, including Forwarding Application, Client Application, Shipper Application, WMS, Consol Planning Tool, Document Platform (AI empowered), Email Platform, Compliance Platform, Work Assignment Engine, Exception Management, AI Copilot,&nbsp;Visibility and Schedules&nbsp;and so on. We are looking for engineers who love learning, are passionate about collaborating, and desire to build solutions with a global impact.</p>\n\n<h2><strong>You will:</strong></h2>\n\n<ul>\n<li>Build highly available, secure, distributed systems in a microservice architecture.</li>\n<li>Design, develop, test and maintain systems that represent the real-world intricacies of logistics entities, such as shipper, client, cargo, document, carrier, container, email etc.</li>\n<li>Collaborate with some of the best engineers in the industry to work on complex business and technical problems.</li>\n<li>Build and launch products rapidly and incrementally. We ship to production dozens of times per day.</li>\n<li>Ensure our products maintain a high-quality bar. We believe in anticipating issues by obsessing over metrics and applying key learnings from post-mortems to all our services.</li>\n<li>Geek out about shipping and logistics. (We do this often.)</li>\n</ul>\n\n<h2><strong>You should have:</strong></h2>\n\n<p><strong>Basic Qualifications</strong></p>\n\n<ul>\n<li>1+ years of experience writing software, and a strong engineering background.</li>\n<li>Knowledge of at least one programming language such as Ruby, C, C++, Java, or Kotlin</li>\n<li>Bachelor's degree in Computer Science or related technical field, or equivalent experience</li>\n</ul>\n\n<p><strong>Preferred Qualifications</strong></p>\n\n<ul>\n<li>A love of simple, well-tested code that is easy to extend and hard to break.</li>\n<li>A bias for action. When you see a problem, you solve it.</li>\n<li>Knowledge of professional software engineering practices &amp; best practices for full software development life cycle, including coding standards, code reviews, source control management, continuous deployments, testing, and operations</li>\n<li>Non-optional: an aptitude for learning quickly.</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<div><div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<h4>Commitment to Equal Opportunity</h4>\n<p>At Flexport, our ability to fulfill our mission of making global commerce easy and accessible relies on having a diverse, dedicated and engaged workforce. All qualified applicants will receive consideration for employment regardless of race, color, religion, sex, national origin, age, physical and mental disability, health status, marital and family status, sexual orientation, gender identity and expression, military and veteran status, and any other characteristic protected by applicable law.</p>\n<h4>Global Data Privacy Notice for Job Candidates and Applicants</h4>\n<p>Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants.&nbsp;By submitting your application, you are agreeing to our use and processing of your data as required. Please see our Privacy Notice available at&nbsp;<a href=\"http://www.flexport.com/privacy\" rel=\"noopener noreferrer\">www.flexport.com/privacy</a>&nbsp;for additional information.</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div></div>",
        "source": "The Muse"
      }
    }
  ],
  "applications": []
}